/**
 * 用户名/账户名正则表达式
 * @type {RegExp}
 */
export const userNameRegExp = /^[a-zA-Z0-9][a-zA-Z0-9@_.\\-]*[a-zA-Z0-9]$/;
/**
 * 真实姓名正则表达式
 * @type {RegExp}
 */
export const realNameRegExp = /^[a-zA-Z]*$|^[\u4E00-\u9FA5]*$/;
/**
 * 手机号码正则表达式
 * @type {RegExp}
 */
export const phoneRegExp = /^[1][3-9]\d{9}$|^([9])\d{7}$/;
/**
 * 昵称正则表达式
 * @type {RegExp}
 */
export const nickNameRegExp = /^[a-zA-Z]*$|^[\u4E00-\u9FA5]*$|^[a-zA-Z0-9\u4E00-\u9FA5]*$/;
/**
 * 工号正则表达式
 * @type {RegExp}
 */
export const jobNumberRegExp = /^[a-zA-Z]+[0-9]+$|^[0-9]+$/;
/**
 * 组织名称正则表达式
 * @type {RegExp}
 */
export const orgNameRegExp = /^[a-zA-Z0-9\u4e00-\u9fa5]*$/;
/**
 * 角色名称正则表达式
 * @type {RegExp}
 */
export const roleNameRegExp = /^[a-zA-Z]*$|^[\u4E00-\u9FA5]*$|^[0-9]*$|^[a-zA-Z0-9\u4E00-\u9FA5]*$/;
/**
 * ipv6正则表达式
 * @type {RegExp}
 */
export const ipv6RegExp =
  /^(((([0-9A-Fa-f]{1,4}:){7}([0-9A-Fa-f]{1,4}|:))|(([0-9A-Fa-f]{1,4}:){6}(:[0-9A-Fa-f]{1,4}|((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){5}(((:[0-9A-Fa-f]{1,4}){1,2})|:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){4}(((:[0-9A-Fa-f]{1,4}){1,3})|((:[0-9A-Fa-f]{1,4})?:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){3}(((:[0-9A-Fa-f]{1,4}){1,4})|((:[0-9A-Fa-f]{1,4}){0,2}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){2}(((:[0-9A-Fa-f]{1,4}){1,5})|((:[0-9A-Fa-f]{1,4}){0,3}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){1}(((:[0-9A-Fa-f]{1,4}){1,6})|((:[0-9A-Fa-f]{1,4}){0,4}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(:(((:[0-9A-Fa-f]{1,4}){1,7})|((:[0-9A-Fa-f]{1,4}){0,5}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:)))(%.+)?)(\/((12[0-8])|(1[0-1]\d)|([1-9]\d?)))?$/;
/**
 * ipv4正则表达式
 * @type {RegExp}
 */
export const ipv4RegExp =
  /^(((1?[0-9]?\d|2[0-4]\d|2[0-5][0-5])\.){3}(1?[0-9]?\d|2[0-4]\d|2[0-5][0-5]),)*(((1?[0-9]?\d|2[0-4]\d|2[0-5][0-5])\.){3}(1?[0-9]?\d|2[0-4]\d|2[0-5][0-5]))$/;
/**
 * ip地址段校验 可验证1个ip/多个用逗号单独隔开ip/cd段ip
 * @type {RegExp}
 */
export const ipv4SegmentRegExp =
  /^((1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))\.){3}(1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))$|^((1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))\.)((1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))\.)((1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))(-(1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5])))?\.)(1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))(-(1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5])))?$|^((1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))\.){3}(1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))(,((1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5]))\.){3}(1?[0-9]?[0-9]|2([0-4][0-9]|5[0-5])))*$/;
/**
 * 端口段校验
 * @type {RegExp}
 */
export const portStrByCrossRegExp =
  /^(([1-9]|[1-9]\d{1,3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])-)?([1-9]|[1-9]\d{1,3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/;

/**
 * 根据密码等级获取密码正则表达式
 * @type {function(*): RegExp}
 */
export const passwordRegExpByLevel = (level) =>
  [
    /^[^\s](((?=[\x21-\x7e]+)[^A-Za-z0-9])+|[A-Z]+|[a-z]+|[0-9]+){3,}$/,
    /^(?![A-Z]+$)(?![a-z]+$)(?!\d+$)(?![\W_]+$)(\S+){6,}$/,
    /^(?![a-zA-Z]+$)(?![A-Z0-9]+$)(?![A-Z\W_]+$)(?![a-z0-9]+$)(?![a-z\W_]+$)(?![0-9\W_]+$)[a-zA-Z0-9\W_][^\s]{7,}$/,
  ][+level];
/**
 * url地址正则表达式
 * @type {RegExp}
 */
export const urlRegExp = /(https?:\/\/)((\w|=|\?|\.|\/|&|-)+)/;
/**
 * 邮箱主机正则表达式
 * @type {RegExp}
 */
// eslint-disable-next-line no-useless-escape
export const emailHostRegExp = /^[a-z0-9\.-]*$/;

/**
 * 邮箱正则表达式
 * @type {RegExp}
 */
// eslint-disable-next-line no-useless-escape
export const emailRegExp = /^[a-zA-Z0-9_-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$/;

/**
 * <>^和空格正则表达式
 * @type {RegExp}
 */
export const cuspBracketsRegExp = /[\^<>\s]/im;

/**
 * 只能使用中文和英文正则表达式
 * @type {RegExp}
 */
export const zhAndEnOnlyRegExp = /^[a-zA-Z\u4e00-\u9fa5]+$/;

/**
 * 公司名称正则表达式
 * @type {RegExp}
 */
export const companyNameRegExp = /^[a-zA-Z\u4e00-\u9fa5-]+$/;

/**
 * 公司产品名称正则表达式
 * @type {RegExp}
 */
export const companyProductNameRegExp = companyNameRegExp;

/**
 * 节点名称正则表达式
 * @type {RegExp}
 */
export const nodeNameRegExp = /^[-\u4e00-\u9fa5\w()]+$/;
